IdeaRS.OpenModel.Geometry3D.Segment3D
Represents a segment in three-dimensional space.

IdeaRS.OpenModel.Geometry3D.Segment3D.StartPoint
Gets or sets the reference to IdeaRS.OpenModel.Geometry3D.Point3D startpoint of the segment.

IdeaRS.OpenModel.Geometry3D.Segment3D.EndPoint
Gets or sets the reference to IdeaRS.OpenModel.Geometry3D.Point3D endpoint of the segment.

IdeaRS.OpenModel.Geometry3D.Segment3D.LocalCoordinateSystem
Local coordinate system